vvod = input('введите текст >')
file = open("lastTranslate.txt", "w")
file.write(vvod)
file.close()
baza = {
"a": "-·"     ,
"b": "-···"   ,
"c": "-·-·"   ,
"d": "-··"    ,
"e": "·"      ,
"f": "··-·"   ,
"g": "--·"    ,
"h": "····"   ,
"i": "··"     ,
"j": "·---"   ,
"k": "-·-"    ,
"l": "·-··"   ,
"m": "--"     ,
"n": "-·"     ,
"o": "---"    ,
"p": "·--·"   ,
"q": "--·-"   ,
"r": "·-·"    ,
"s": "···"    ,
"t": "-"      ,
"u": "··-"    ,
"v": "···-"   ,
"w": "·--"    ,
"x": "-··-"   ,
"y": "-·--"   ,
"z": "--··"   ,
"A": "-·"     ,
"B": "-···"   ,
"C": "-·-·"   ,
"D": "-··"    ,
"E": "·"      ,
"F": "··-·"   ,
"G": "--·"    ,
"H": "····"   ,
"I": "··"     , 
"J": "·---"   ,
"K": "-·-"    ,
"L": "·-··"   ,
"M": "--"     ,
"N": "-·"     , 
"O": "---"    ,
"P": "·--·"   ,
"Q": "--·-"   ,
"R": "·-·"    ,
"S": "···"    ,
"T": "-"      ,
"U": "··-"    ,
"V": "···-"   ,
"W": "·--"    ,
"X": "-··-"   ,
"Y": "-·--"   ,
"Z": "--··"   ,
"1": "·----"  ,
"2": "··---"  , 
"3": "···--"  ,
"4": "····-"  ,
"5": "·····"  ,
"6": "-····"  ,
"7": "--···"  ,
"8": "---··"  ,
"9": "----·"  ,
"0": "-----"  ,
" ": "       ",
".": "."      ,
",": ","      ,
"/": "/"      ,
"?": "?"      ,  
"!": "!"      ,
";": ";"      ,
":": ":"
}

mass_eng = []

with open("lastTranslate.txt") as f:
    i = 0
    while i < len(vvod):
        i += 1 
        d = (f.read(1))
        mass_eng += [d]

    print("".join(mass_eng))


mass_morse = []
i = 0
while i < len(vvod):
	mass_morse += [baza[mass_eng[i]]]
	i += 1
	
result = "   ".join(mass_morse)
print(result)

file = open("lastTranslate.txt", "a")
file.write("\n"+ result)
file.close()

exit = input('нажмите enter для закрытия прграммы')
